app/views/orders/index.html.erb

      <td><%= order.customer_name %> </td>
      <td><%= pizza_size_display(order.pizzas.first.size) %> </td>
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."order_id" = 1 LIMIT 1