app/controllers/orders_controller.rb

INSERT INTO "orders" ("created_at", "customer_name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 25 Oct 2012 20:51:05 UTC +00:00], ["customer_name", "testing customer name"], ["updated_at", Thu, 25 Oct 2012 20:51:05 UTC +00:00]]
---
  def create
    ingredients = params[:ingredients]
    ingredients_string = ingredients.join ' '
    params[:order][:pizzas_attributes]["0"][:toppings] = ingredients_string
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."order_id" = 11 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])
    @toppings_array = @order.pizzas.first.toppings.split ' '

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def update
    ingredients = params[:ingredients]
    ingredients_string = ingredients.join ' '
    params[:order][:pizzas_attributes]["0"][:toppings] = ingredients_string
    @order = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 1]]
---
  def destroy
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.destroy

SELECT "orders".* FROM "orders"
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 4]]
---
  def destroy_all
    orders = Order.all
    orders.each do |order|
      order.destroy